Revit 2026 API

# DocumentGetHubId Method

---

Gets ForgeDM hub id where the model locates. It is cached in session.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetHubId()
```
```vb
Public Function GetHubId As String
```
```cpp
public:
String^ GetHubId()
```
```fsharp
member GetHubId : unit -> string
```

#### Return Value

String

| Exception | Condition |
| --- | --- |
| RevitServerUnauthorizedException | Thrown when cannot get data from ForgeDM for Revit cloud model. |

It is empty for non-cloud model; It is cached in Revit model opened session after getting it;

#### Reference

Document Class

Autodesk.Revit.DB Namespace